---
Лабораторный практикум:
 заголовок: 'Лабораторная работа 03.2: Приложение холста'
 модуль: 'Модуль 03: Создание приложения холста'
---

> [!ПРИМЕЧАНИЕ]
> С ноября 2020 г .:
> - Common Data Service переименована в Microsoft Dataverse. [Подробнее…](https://aka.ms/PAuAppBlog)
> - Обновлена некоторая терминология в Microsoft Dataverse. Например, *entity/объект* теперь *table/таблица*, а *field/поле* теперь *column/столбец*. [Подробнее…](https://go.microsoft.com/fwlink/?linkid=2147247)
>


# Лабораторная работа 03.2: Приложение холста

В этом модуле вы разработаете и создадите приложение на основе холста, чтобы сотрудники компании могли отправлять отчеты о проблемах.

## Что вы узнаете

 - Как импортировать и использовать предварительно созданную библиотеку компонентов
 - Как создать приложение холста Power Apps.
 - Как подключиться к источнику данных
 - Как фильтровать данные
 - Как создавать строки данных
 - Как использовать изображения с строками данных
 - Как встраивать приложение холста Power Apps в Microsoft Teams

## Лабораторные этапы высокого уровня

 - Импорт комплектующих компании
 - Создание главного экрана приложения и макета (включая список моих элементов)
 - Отправка нового отчета
 - Тестовое задание
 - Встраивание приложения холста в Microsoft Teams

## Предварительные требования

* Должно быть выполнено **Лабораторная работа 02.1: Модель данных и приложение на основе модели**

## Подробные шаги

 ### Упражнение 1: Создание приложения холста

В этом упражнении вы импортируете решение с общими компонентами, создадите представление для таблицы отчетов о проблемах и создадите приложение холста.

#### Задача 1: Импорт решения компонента библиотеки

В этой задаче вы импортируете решение общих компонентов в свою среду. Эта общая библиотека компонентов была создана другой командой вашей компании.

1. Перейдите на страницу [Портал разработчика Power Apps](https://make.powerapps.com/) и убедитесь, что вы находитесь в правильной среде.

2. Выберите **Решения** и нажмите **Импорт**.

![Снимок экрана со стрелкой, указывающей на кнопку импорта](03-2/media/image1.png)

3. Щелкните **Обзор**.

4. Перейдите в папку ресурсов курса, выберите решение **Общие компоненты** и нажмите **Открыть**.

5. Щелкните **Далее**.

6. Щелкните **Импорт** и дождитесь завершения импорта.

7. Щелкните **Опубликовать все настройки** и дождитесь завершения публикации.

8. Теперь вы должны увидеть импортированное решение **Общие компоненты**. Щелкните, чтобы открыть решение **Общие компоненты**.

9. В решении должен быть один элемент. (**Общие компоненты Lamna Healthcare**)

![Скриншот окна общих компонентов с элементом общих компонентов Lamna Healthcare](03-2/media/image2.png)

> [!ВАЖНО]
> Существует проблема, из-за которой импорт приложения как части решения может не добавить его в вашу библиотеку компонентов. Следующие шаги предназначены для решения проблемы.

10. Перейдите к **Приложениям**, выберите **Приложение общих компонентов Lamna Healthcare**.
11. Щелкните **значок редактирования**, чтобы отредактировать приложение.

![Снимок экрана со стрелкой, указывающей на кнопку редактирования](03-2/media/image2-1.png)

12. Выберите **регион/страну** и нажмите **Начать** при появлении запроса.
 
 > [!Примечание]
 >
 > Когда приложение открыто в режиме редактирования, переходите к следующему шагу, поскольку компонент Preloader показывает значок «Загрузка», но на самом деле не ждет загрузки.
13. После открытия приложения щелкните **Файл** > **Сохранить как**.
14. Сохраните приложение как ** Общие компоненты Lamna Healthcare A**.

![Снимок экрана с рамкой вокруг имени приложения, сохраненный как Lamna Healthcare Shared Components A](03-2/media/image2-2.png)

14. Нажмите **ОК**.
15. Закройте вкладку **Общие компоненты Lamna Healthcare** в своем браузере.

#### Задача 2: Создание представления

В этой задаче вы создадите представление, в котором будут отображаться отчеты о проблемах текущего пользователя. Позже вы будете использовать это представление с функцией фильтра в приложении холста.

1. Перейдите на страницу [Портал разработчика Power Apps](https://make.powerapps.com/) и убедитесь, что вы находитесь в правильной среде.

2. Выберите **Решения** и щелкните, чтобы открыть решение **Компания 311**.

3. Найдите и щелкните, чтобы открыть таблицу **Отчеты о проблемах**.

4. Выберите вкладку **Представления** и щелкните, чтобы открыть представление **Активные отчеты о проблемах**.

![Снимок экрана со стрелкой, указывающей на кнопку просмотра активных отчетов о проблемах](03-2/media/image3.png)

5. Щелкните **Изменить фильтры**.

![Снимок экрана со стрелкой, указывающей на кнопку редактирования фильтров](03-2/media/image4.png)

6. Измените фильтр на **Создано равным текущему пользователю** и нажмите **ОК**.

![Скриншот окна редактирования фильтров](03-2/media/image5.png)

7. Нажмите кнопку с шевроном рядом с кнопкой «Сохранить» и выберите **Сохранить как**.

![Снимок экрана со стрелкой, указывающей на кнопку «Сохранить как»](03-2/media/image6.png)

8. Введите **Мои отчеты** в поле **Имя** и нажмите **Сохранить**.

9. Нажмите **Опубликовать** и дождитесь завершения публикации.

10. Нажмите кнопку **Назад** на вкладке браузера, чтобы вернуться к сведениям в таблице отчета о проблемах.

#### Задача 3: Создание пользовательского приложения

В этой задаче вы создадите приложение на основе холста, используя форм-фактор телефона.

1. Перейдите на страницу [Портал разработчика Power Apps](https://make.powerapps.com/) и убедитесь, что вы находитесь в правильной среде.

2. Выберите **Решения** и щелкните, чтобы открыть решение **Компания 311**.

3. Щелкните **+ Создать | Приложение | Приложение холста**.

![Снимок экрана со стрелкой, указывающей на новую кнопку с раскрывающимся меню под приложением и рамкой вокруг кнопки приложения холста](03-2/media/image7.png)

4. Введите **Мобильное Приложение Компания 311**, выберите **Мобильное устройство** для формата и нажмите **Создать**.

5. Выберите **Пропустить**.

6. Перейдите в древовидное представление и дважды щелкните **Экран1**.

![Снимок экрана со стрелкой, указывающей на кнопку экрана 1](03-2/media/image9.png)

10. Переименуйте экран в **Главный экран**. Всегда полезно давать вашим экранам понятное имя.

![Снимок экрана с выделенным названием экрана 1, переименованным в главный экран](03-2/media/image10.png)

11. Выберите **Главный экран** и нажмите **Вставить**.

![Снимок экрана со стрелкой, указывающей на значок плюса для вставки](03-2/media/image11.png)

12. Выберите **Получить больше компонентов**.

![Снимок экрана с рамкой вокруг кнопки получения дополнительных компонентов](03-2/media/image12-1.png)

13. Разверните библиотеку **Общие Компоненты Lamna Healthcare A**, выберите **Заголовок** и **Вкладка**, а затем нажмите **Импорт**.

![Снимок экрана окна компонентов импорта с выбранными элементами управления заголовком и вкладкой](03-2/media/image12-2.png)


14. Разверните **Компоненты библиотеки**, выберите **Элемент управления заголовком** и **Элемент управления вкладкой**. Оба этих компонента из библиотеки, которую вы импортировали ранее в лабораторной работе.

![Снимок экрана с рамкой вокруг элементов библиотеки Заголовок и Вкладка](03-2/media/image12-3.png)

15. Переместите **Контроль вкладкой** в нижнюю часть экрана, а **Контроль заголовком** - в верхнюю.

16. Выберите **Заголовок** и в параметре **Текст** измените значение на **«Компания 311».**

![Снимок экрана с рамкой вокруг вкладки выражения с текстовым параметром, значение которого изменено на компанию 311](03-2/media/image13.png)

17. Установите **высоту** **элемента управления заголовком** на **75**.

 ![Установка высоты заголовка](03-2/media/image37.png)

18. Щелкните правой кнопкой мыши на главном экране и выберите **Дублировать экран**.

![Снимок экрана с рамкой вокруг кнопки дубликата экрана](03-2/media/image14.png)

18. Переименуйте новый экран в **Новый экран отчетов**.

19. Выберите **Древовидное представление**, выберите **Приложение** и измените значение **OnStart** на формулу ниже. Эта формула создаст новую переменную с именем Мои вкладки и установит ее в таблицу элементов вкладок.

```javascript
Set('My Tabs', Table( {
	Label: "My Reports",
	Screen: 'Main Screen',
	Icon: "",
	SelectedIcon:""
},
{
	Label: "New Report",
	Screen: 'New Reports Screen',
	Icon: "",
	SelectedIcon:""
}
))
```

> [!ВАЖНО]
> При копировании выражений кавычки и двойные кавычки иногда заменяются их «умными» эквивалентами, которые недопустимы в формулах. Если вы скопируете и вставите приведенное выше выражение, убедитесь, что полученная формула не содержит ошибок.

![Скриншот скопированного выражения на вкладке выражения](03-2/media/image15.png)

20. Выберите **Контроль вкладки** на **Главном Экране** и измените значение **Элементы** на **Мои вкладки**.

![Снимок экрана со значениями элементов, установленными на мои вкладки для элемента управления вкладками](03-2/media/image16.png)

21. Измените значение **ВыбранныйЦвет** на **БелыйДым**.

22. Выберите **Контроль вкладки** внутри **Нового экрана отчета** и установите для параметра Элемент значение **Мои вкладки**.

23. Измените значение **ВыбранныйЦвет** на **БелыйДым**.

24. Нажмите кнопку **…** в **приложении** и выберите **Запуск при включении**.

![Скриншот кнопки запуска при включении на значке с многоточием, подробнее под кнопкой приложения](03-2/media/image17.png)

25. Теперь на ваших вкладках должны отображаться две добавленные вами вкладки.

![Снимок экрана с двумя добавленными вами вкладками](03-2/media/image18.png)

26. Щелкните **Файл**, а затем **Сохранить**.
27. Нажмите кнопку **<- назад**.

28. Не уходите с этой страницы.

### Упражнение 2: Мои отчеты

В этом упражнении вы добавите галерею, в которой будут отображаться отчеты, созданные текущим вошедшим в систему пользователем.

#### Задача 1. Добавить галерею

1. Выберите **Главный экран**, перейдите на вкладку **Вставка**, щелкните **Галерея** и выберите **Вертикально**.

![Снимок экрана со стрелкой, указывающей на вариант вертикальной галереи](03-2/media/image19.png)

2. Переименуйте новую галерею в **Моя галерея отчетов**.

3. Измените размер и положение **Моей галереи отчетов** и убедитесь, что экран выглядит так, как показано на рисунке ниже.

![Выбран снимок экрана галереи моих отчетов](03-2/media/image20.png)

4. Выберите **Моя галерея отчетов**, перейдите на панель **Свойства** и выберите **Отчеты о проблемах** для **Источник данных**. Если вы не видите отчеты о проблемах, нажмите **Просмотреть все таблицы** или **Искать** для таблицы.

![Скриншот окна галереи моих отчетов и панели свойств с отчетами о проблемах, выбранными для источника данных](03-2/media/image21.png)

5. Выберите представление **Мои отчеты**, созданное для **Просмотра**.

6. Щелкните **Изменить поля**.

![Снимок экрана со стрелкой, указывающей на кнопку редактирования](03-2/media/image22.png)

7. Измените Подзаголовок1 на **кодсостояния**. Это столбец причины состояния.

![Скриншот рамки вокруг подзаголовка 1, измененного на правильное имя](03-2/media/image23.png)

8. Щелкните **Файл**, а затем **Сохранить**.

9. Нажмите кнопку **<- Назад**.

10. Не уходите с этой страницы.

### Упражнение 3. Разрешение удаления отчетов

В этом упражнении вы разрешите удалять неназначенные отчеты. Это позволит пользователям легко удалять любые случайно созданные отчеты.

#### Задача 1. Разрешить удаление

1. Разверните **Галерею моих отчеты**.

2. Щелкните **Icon** в **галерее моих отчетов**.

![Снимок экрана со стрелкой в галерее моих отчетов](03-2/media/image24.png)

3. Измените значение **Icon** на **Icon.Trash**.

![Скриншот icon.trash, набранный на вкладке выражения](03-2/media/image25.png)

4. Измените значение **Visible** на формулу ниже. Эта формула скроет значок, если причина статуса не «Новая».

`If(Text(ThisItem.'Status Reason') = "New", true, false)`

![Скриншот вкладки выражения со вставленной соответствующей командой](03-2/media/image26.png)

5. Убедитесь, что значок все еще выбран. Измените значение **OnSelect** на формулу ниже. Эта формула удалит элемент из источника данных.

`Remove('Problem Reports', ThisItem)`

6. Щелкните **Файл**, а затем **Сохранить**.

7. Нажмите кнопку **<-** **Назад**.

8. Не уходите с этой страницы.

### Упражнение 4: Добавление нового отчета

В этом упражнении вы добавите форму для отправки новых отчетов о проблемах.

#### Задача 1: Добавление новой формы отчета

1. Выберите **Экран нового отчета**, перейдите на вкладку **Вставка**, щелкните **Форма** и выберите **Изменить**.

![Снимок экрана со вкладкой вставки и выбранной кнопкой форм](03-2/media/image27.png)

2. Переименуйте форму в **Новая форма отчета**.

3. Выберите **Новая форма отчета**, перейдите на панель **Свойства** и выберите **Отчет о проблеме** для **Источник данных**.

4. Щелкните **Изменить поля**.

![Снимок экрана со стрелкой, указывающей на кнопку редактирования полей](03-2/media/image28.png)

5. Удалите столбец **Причина состояния**.

![Снимок экрана со стрелкой, указывающей на значок эллипса для дополнительных параметров и рамкой вокруг кнопки удаления](03-2/media/image29.png)

6. Удалите столбец **Создано**.

7. Удалите столбец **Местоположение**.

8. Щелкните **+ Добавить поле**.

9. Выберите **Подробности**, **Здание**, **Отдел** и **Фото**, а затем нажмите **Добавить**.

![Скриншот фотографии, деталей, здания и местоположения, выбранных в окне полей](03-2/media/image30.png)

10. Измените размер и положение формы, чтобы она занимала большую часть страницы и оставила достаточно места для кнопки внизу.

![Снимок экрана формы с измененным размером и перемещением для места внизу для кнопки](03-2/media/image31.png)

11. Выберите **Новый экран отчета**.

12. Перейдите на вкладку **Вставка** и выберите **Кнопка**.

13. Переименуйте кнопку **Отправить отчет**.

14. Разместите кнопку под формой и растяните ее по экрану.

15. Измените свойство **текст** кнопки **Отправить отчет** на **Отправить**.

16. Нажмите кнопку «Отправить отчет» и измените значение **OnSelect** на формулу ниже. Эта формула создаст новую строку в таблице отчетов о проблемах.

`SubmitForm('New Report Form')`

17. Выберите **Форму нового отчета**.

18. Измените значение **OnSuccess** на формулу ниже. Эта формула покажет уведомление после создания новой строки и очистит форму, когда создание записи будет успешным.

`Notify("Created new problem report row");NewForm('New Report Form')`

19. Выберите **Экран нового отчета**.

20. Установите значение **OnVisible** в формулу ниже. Эта формула создаст новую форму, когда экран станет видимым.

`NewForm('New Report Form')`

21. Щелкните **Файл**, а затем **Сохранить**.
22. Нажмите **Опубликовать**.
23. Нажмите **Опубликовать эту версию** и дождитесь завершения публикации.
24. Нажмите кнопку **<-** **Назад**.
25. Не уходите с этой страницы.


### Упражнение 5: Тест приложения

В этом упражнении вы протестируете созданное вами приложение холста, отправив отчет о проблеме.

#### Задача 1: Протестируйте приложение

1. Выберите **Главный экран** и нажмите **Предварительный просмотр приложения**.

![Снимок экрана со стрелкой, указывающей на значок воспроизведения для предварительного просмотра приложения](03-2/media/image32.png)

2. Приложение должно загрузиться, и в списке должны появиться все созданные вами отчеты.

![Экран загруженного приложения](03-2/media/image33.png)

3. Выберите вкладку **Новый отчет**.

4. Должна загрузиться **новая форма отчета**. Заполните форму и щелкните столбец **Фото**.

5. Выберите изображение.

6. Нажмите **Отправить**.

7. Строка должна быть создана успешно, и вы должны увидеть сообщение об успешном завершении.

![Экран успешного сообщения «Создана новая запись отчета о проблеме»](03-2/media/image38.png)

8. Выберите вкладку **Мои отчеты**.

9. Вы должны увидеть новый отчет, который вы создали. Нажмите **Удалить**, чтобы проверить удаление.

![Снимок экрана со стрелкой, указывающей на значок корзины, которую нужно удалить](03-2/media/image35.png)

10. Строку следует удалить и убрать из списка.

![Скриншот удаленной и убранной из списка строки](03-2/media/image36.png)

11. **Закройте** предварительный просмотр.
12. **Закройте** студию приложений, закрыв вкладку браузера.

### Упражнение 6. Внедрение приложения холста в Microsoft Teams

В этом упражнении вы добавите мобильное приложение Компания 311, созданное вами ранее, в Microsoft Teams, чтобы сотрудники могли регистрировать проблемы непосредственно в Teams.

#### Задача 1: Настройка команды Компании 311

В этой задаче вы создадите команду **Microsoft Teams** для компании Lamna Healthcare, если вы не сделали этого ранее.

1. Перейдите в [Microsoft Teams](https://teams.microsoft.com) и войдите в систему с теми же учетными данными, которые вы использовали ранее.

2. Выберите **Использовать веб-приложение вместо** на экране приветствия.

![Снимок экрана целой страницы веб-браузера Microsoft Teams с рамкой вокруг кнопки использования веб-приложения вместо](03-2/media/image-3-teams.png)

3. Когда откроется окно Microsoft Teams, закройте приветственные сообщения.

4. Выберите **Команды**.
5. В нижнем левом углу выберите **Присоединиться или создать команду**.

6. Выберите **Создать команду**.

![Снимок экрана с рамкой вокруг кнопки присоединения или создания группы и еще одной рамкой вокруг кнопки создания группы](03-2/media/image-3-createteam.png)

6. Нажмите **С нуля**.

7. Выберите **Публикация**.

8. В поле «Название команды» введите **Компания 311** и выберите **Создать**.

9. Выберите **Пропустить** добавление участников в компанию 311.
10. Не уходите с этой страницы.


#### Задача 2. Добавление приложения холста в Teams

1. Выберите **Общий** канал команды **Компания 311**.

2. В верхней части страницы нажмите символ **+**, чтобы добавить новую вкладку.

![Снимок экрана с рамкой вокруг значка плюса для добавления новой вкладки](03-2/media/image-3-addpowerbitab.png)

4. Найдите **Power** и выберите **PowerApps** из результатов.

5. Выберите **Добавить**, чтобы добавить Power Apps в Teams.

![Снимок экрана с добавлением Power Apps в Teams](03-2/media/image-3-powerappsteams.png)

6. Выберите **мобильно приложение Компания 311**, которое вы создали ранее в этой лабораторной работе. 

> [!ВАЖНО]
> Если вы не видите приложение, вам нужно вернуться в редактор приложений и опубликовать приложение.

7. Выберите **Сохранить**.

8. Приложение **Компания 311** теперь должно появиться на вкладке в Microsoft Teams.

![Снимок экрана приложения компании 311, отображаемого на вкладке в Microsoft Teams](03-2/media/image-3-powerappinteams.png)



### Упражнение 7. Встраивание приложения холста в приложение на основе модели

В этом упражнении вы создадите приложение холста и добавите его в приложение, управляемое моделью.

#### Задача 1. Добавление приложения холста в форму

1. Перейдите на [портал разработчиков Power Apps](https://make.powerapps.com/) и убедитесь, что вы находитесь в своей практической среде.
2. Выберите **Решения** и щелкните, чтобы открыть **Решения компании 311**.
3. Найдите и щелкните, чтобы открыть таблицу **Здание**.
4. Выберите вкладку **Формы** и щелкните, чтобы открыть форму **Информация** типа **Основная**.

![Снимок экрана со стрелкой, указывающей на слово информация с рамкой вокруг типа формы, являющегося основным](03-2/media/opentableform.png)

5. Выберите **раздел формы**.
6. Перейдите на панель «Свойства» и щелкните, чтобы развернуть **Форматирование**.
7. Измените значение **Столбцы** на **2**.

![Снимок экрана с рамкой вокруг количества столбцов](03-2/media/formsectioncolumns.png)

8. Убедитесь, что раздел у вас все еще выбран. Выберите вкладку **Столбцы таблицы**.
9. Снимите флажок **Показывать только неиспользуемые столбцы таблицы** и щелкните столбец **Имя**.

![Снимок экрана со стрелкой, указывающей на кнопку с названием](03-2/media/addcolumntoform.png)

10. Теперь столбец должен появиться в правом столбце раздела. Выберите в форме столбец **Имя**.
11. Установите флажок **Скрыть метку** и нажмите **Сохранить**.

![Снимок экрана со стрелкой, указывающей на кнопку сохранения](03-2/media/saveform.png)

12. Нажмите кнопку **Перейти к классической версии**. При появлении запроса выберите **Пропустить**.

![Снимок экрана со стрелкой, указывающей на кнопку переключения на класс](03-2/media/switchtoclassic.png)

13. Дважды щелкните столбец **Имя**, который вы добавили в форму.
14. Выберите вкладку **Управление** и нажмите **Добавить элемент управления**.

![Снимок экрана со стрелкой, указывающей на добавление кнопки управления](03-2/media/ex_7_addcontrol.png)

15. Выберите **Приложение холста** и нажмите **Добавить**.
16. Щелкните **Настроить**.

![Снимок экрана со стрелкой, указывающей на кнопку настройки](03-2/media/ex_7_customizeapp.png)

17. Должно открыться новое окно или вкладка браузера и загрузить студию приложений.
18. Не уходите с этой страницы.

#### Задача 2: Настройка приложения

1. Щелкните правой кнопкой мыши **Форма1** и выберите **Удалить**.

![Скриншот с рамкой вокруг кнопки удаления](03-2/media/ex_7_deleteform.png)

2. Щелкните **Файл**.
4. Выберите **Облако**, введите **Приложение для внедрения модели** в качестве имени и нажмите **Сохранить**.

![Снимок экрана с надписью «Сохранить как»](03-2/media/ex_7_saveapp.png)

5. Выберите **Настройки**.
6. Выберите **Дисплей**.
7. Введите **400** для ширины.

![Снимок экрана с рамкой вокруг ширины, измененной на 400](03-2/media/ex_7_displaywidth.png)

8. Нажмите **Применить** во всплывающем окне.
9. Введите **500** для ширины.
10. Нажмите **Применить** во всплывающем окне.
11. Закройте всплывающее окно настроек.
12. Выберите объект **Приложение** в древовидном представлении.
13. Выберите **OnStart** объекта **Приложение** и задайте для него формулу ниже. Эта формула создаст две переменные: одну для отслеживания текущего индекса таблицы отчетов, а другую - для отслеживания текущей строки элемента.

```Set(currentIndex,1);Set(CurrentItem, Last(FirstN([@ModelDrivenFormIntegration].Item.'Problem Reports',currentIndex)))```

![Снимок экрана с рамкой вокруг объекта приложения, измененного на onstart и установленного на вышеупомянутую формулу. Также есть еще одна рамка вокруг выбранной кнопки приложения](03-2/media/ex_7_apponstart.png)

14. Выберите вкладку **Вставка** вставки, щелкните **Медиа** и выберите **Изображение**.

![Снимок экрана с рамкой вокруг кнопки изображения](03-2/media/ex_7_insertimage.png)

15. Выберите только что добавленное изображение и установите значение **Изображение** в формулу ниже.

```CurrentItem.Photo```

16. Нажмите кнопку **... ** объекта **Приложение** и выберите **Запуск при включении**.

![Снимок экрана со стрелкой, указывающей на значок эллипса для дополнительных параметров и рамкой вокруг кнопки запуска при включении](03-2/media/ex_7_runonstart.png)

17. Вы должны увидеть фото. Выберите **Управление изображением** в древовидном представлении.

![Скриншот значка сломанной двери](03-2/media/ex_7_imagephoto.png)

18. Установите значение изображения **X** на **0**.
19. Установите значение изображения **Y** на **0**.
20. Установите значение **Ширина** изображения по формуле ниже.

`` Родитель.Ширина``

21. Установите значение ** Высота ** изображения по формуле ниже.

```Parent.Width```

22. Перейдите на панель **Свойства** и выберите **Заливка** для **Положение изображения**.

![Скриншот со стрелкой, указывающей на вкладку файла](03-2/media/ex_7_imageposition.png)

23. Щелкните **Файл**, а затем щелкните **Сохранить**, чтобы сохранить ваш прогресс.
24. Нажмите кнопку **<-** **Назад**.
25. Не уходите с этой страницы.


#### Задача 3: Добавление элемента управления

1. Выберите вкладку **Вставка** и нажмите **Ярлык**.
2. Выберите только что добавленную метку и установите значение **Текст** в формулу ниже.

```CurrentItem.Title```

3. Установите значение **Высота** метки на **60**.
4. Установите значение метки **X** на **0**.
5. Установите значение метки **Y** в формулу ниже.

```Parent.Height -Self.Height```

6. Задайте для значения **Ширина** метки формулу, приведенную ниже.

```Parent.Width```

7. Установите значение метки **Заливка** на **RGBA (0, 108, 191, .5)**.
8. Установите значение метки **Цвет** на **RGBA (255, 255, 255, 1)**.
9. Установите значение **Align** в формулу ниже.

```Align.Center```

10. Теперь метка должна выглядеть как на изображении ниже. Если вы не видите заголовок, нажмите кнопку **...** объекта **Приложение** и **Run OnStart** снова.

![Скриншот значка сломанной двери с меткой](03-2/media/ex_7_resizedlabel.png)

11. На вкладке **Вставка** щелкните **Значки** и выберите **Далее**.
12. Дважды щелкните только что добавленный значок и переименуйте его в **Следующий значок**.
13. На вкладке **Вставка** щелкните **Значки** и выберите **Назад**.
14. Дважды щелкните второй значок, который вы только что добавили, и переименуйте его в **Значок "Назад"**.
15. Перетащите значок **Далее** в место над правой стороной метки.
16. Перетащите значок **Назад** в место над левой стороной метки.
17. Значки теперь должны выглядеть, как на изображении ниже.

![Скриншот значка сломанной двери со значками "Далее" и "Назад"](03-2/media/ex_7_iconlocation.png)

18. Щелкните значок **Далее** и установите значение **OnSelect** в формулу ниже.

```UpdateContext({CurrentItem: Last(FirstN([@ModelDrivenFormIntegration].Item.'Problem Reports',currentIndex))});Set(currentIndex, currentIndex +1)```

19. Задайте для значения **DisplayMode** значка **Далее** формулу, приведенную ниже.

```If(currentIndex = CountRows([@ModelDrivenFormIntegration].Item.'Problem Reports'), DisplayMode.Disabled, DisplayMode.Edit)```

20. Выберите **значок «Назад»** и установите значение **OnSelect** в формулу ниже.

```UpdateContext({CurrentItem: Last(FirstN([@ModelDrivenFormIntegration].Item.'Problem Reports',currentIndex))});Set(currentIndex, currentIndex -1);```

21. Задайте для значения **DisplayMode** значка **Назад** формулу, приведенную ниже.

```If(currentIndex > 1, DisplayMode.Edit, DisplayMode.Disabled)```

22. Щелкните **Файл**, а затем **Сохранить**.

23. Откройте новую вкладку браузера и перейдите на страницу [Портал разработчика Power Apps](https://make.powerapps.com/) и убедитесь, что вы находитесь в правильной среде.

24. Выберите **Приложения** и щелкните, чтобы запустить приложение **Администратор компании 311**.

25. Щелкните **Изменить область** и выберите **Настройки**.

![Изменение области карты сайта - снимок экрана](03-2/media/image39.png)

26. Выберите **Здания**. 

27. Отсортируйте строки зданий в столбце **Создано** в порядке от **от старых к новым**. Запишите самую старую запись.

28. Щелкните **Изменить область** и выберите **Управление проблемами**.

29. Выберите **Отчеты о проблемах**.

30. Нажмите **+ Создать**. 

31. Введите **Сломанный кран** в поле Имя, выберите самое старое здание в столбце **Здание** и введите **Кран сломан, и вода непрерывно течет** в столбце Подробности. Добавьте любое изображение по вашему выбору в столбец **Фото**.

32. Нажмите **Сохранить**.

33. Нажмите **+ Создать**.

34. Введите **Течет крыша** в поле Имя, выберите самое старое здание в столбце **Здание** и введите **Вода просачивается через потолок** в столбце Детали. Добавьте любое изображение по вашему выбору в столбец **Фото**.

35. Нажмите **Сохранить** и закройте вкладку браузера в приложении на основе модели.

36. Откройте редактор приложений холста для приложения **Приложение для встраивания модели**. Выберите значок **Данные** в левом меню.

 ![Выбор данных - снимок экрана](03-2/media/image40.png)

37. Найдите **Отчеты о проблемах** и нажмите **многоточие**, а затем нажмите **Обновить**.

38. Нажмите кнопку **...** объекта **Приложение** и выберите **Запуск при включении**.

39. Выберите **древовидное представление** в левом меню и выберите экран **ФормаЭкрана**.

40. Щелкните **Запуск**.

41. Щелкните значки «Далее» и «Назад» и убедитесь, что изображение изменилось.

42. Закройте превью.

43. Щелкните **Файл**.

44. Нажмите **Сохранить**.

45. Нажмите **Опубликовать**.

46. Нажмите **Опубликовать эту версию** и дождитесь завершения публикации.

47. Закройте окно или вкладку браузера студии приложений.

48. Теперь вы должны вернуться в **Свойства поля**. Выберите **Вэб, телефон, планшет** и нажмите **ОК**.

![Снимок экрана с рамкой вокруг элемента приложения холста, находящегося под контролем, когда выбраны Интернет, телефон или планшет. Также есть стрелка, указывающая на кнопку ОК в нижней части окна](03-2/media/ex_7_fieldproperties.png)

49. Нажмите **Сохранить** в классическом редакторе форм.
50. Закройте окно или вкладку браузера классического редактора форм.
51. Теперь вы должны вернуться в современный редактор форм. Нажмите кнопку **<-** **Назад**.

![Скриншот со стрелкой, указывающей на кнопку назад](03-2/media/ex_7_backtomaker.png)

52. Выберите **Решения**.
53. Щелкните **Опубликовать все настройки** и дождитесь завершения публикации.


#### Задача 4: Тестировка приложения

1. Выберите **Приложения** и щелкните, чтобы запустить приложение **Администратор компании 311**.

 ![Снимок экрана со стрелкой, указывающей на приложение администратора компании 311](03-2/media/ex_7_launchmodelapp.png)

2. Выберите **Отчеты о проблемах** и щелкните, чтобы открыть одну из строк отчета о проблемах.
3. Убедитесь, что у проблемы есть фотография, и нажмите на поиск **Здания**.

 ![Снимок экрана со стрелкой, указывающей на поиск здания](03-2/media/ex_7_lookup.png)

4. Приложение холста должно загрузиться внутри модельно-управляемого приложения. Щелкните значки «Далее» / «Назад» и убедитесь, что приложение работает должным образом.

 ![Снимок экрана со значком сломанной двери в контексте приложения холста внутри модельно-управляемого приложения](03-2/media/ex_7_canvasinmodel.png)
